[net]
batch=64
subdivisions=1
height=32
width=32
channels=3
momentum=0.9
decay=0.0005

learning_rate=0.1
policy=steps
steps=10000,20000,30000,40000,50000
scales=0.5,0.5,0.1,0.1,0.1
max_batches = 60000

#learning_rate=0.4
#policy=poly
#power=4
#max_batches = 20000

[crop]
crop_width=28
crop_height=28
flip=0
angle=0
saturation = 0
exposure = 0
noadjust=1

[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

#[augment]
#splits=1

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

#[route]
#layers=-1,-4,-7

[convolutional]
batch_normalize=1
filters=100
size=1
stride=1
pad=0
activation=leaky

[avgpool]

[softmax]
groups=1

[cost]

